Revit 2026 API

# LinkNodeGetDocument Method

---

Returns the document associated with the link.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Document GetDocument()
```
```vb
Public Function GetDocument As Document
```
```cpp
public:
Document^ GetDocument()
```
```fsharp
member GetDocument : unit -> Document
```

#### Return Value

Document Instance of a Document

The document is in read-only state. Transactions are not allowed in it.

#### Reference

LinkNode Class

Autodesk.Revit.DB Namespace